{
    "data": [
        {
            "id": 5816705,
            "companyId": 51022,
            "name": "Front-end Developer I Sênior VTEX [REMOTO]",
            "description": "Somos referência na implantação de negócios digitais na América Latina e Europa.Como uma das maiores empresas desse nicho, somos reconhecidos por nossa excelência, e hoje estamos posicionados como a agência mais valiosa (MVP) do Quadrante Vtex.Com operações no Brasil, México, Chile, Argentina e Espanha, atuamos em mais de 40 países junto às maiores marcas do mercado com serviços de desenvolvimento, implantação e evolução de e-commerce, SEO, Mídia, CRO&nbsp;e CRM.Crescemos muito e continuamos nessa expansão, assumindo projetos cada vez maiores, mais complexos e desbravando mercados internacionais. Nesse processo fomos adquiridos pelo grupo WPP, maior empresa de comunicação do mundo.Hoje contamos&nbsp;com mais de 600 pessoas&nbsp;corajosas, determinadas, inovadoras, ágeis e colaborativas que lideram e constroem juntas o futuro do e-commerce. Vem construir esse futuro com a gente #vemsercorebiz.Responsabilidades e atribuiçõesResponsável pelo desenvolvimento, manutenção e melhoria constante nos projetos, buscando garantir o seu funcionamento nos mais variados tipos de navegadores e dispositivos, trabalhando em conjunto com os times de design e backend para que todas as funcionalidades e elementos visuais atendam as expectativas.Garantir alta qualidade, visando a otimização e performance do seu código, além de se preocupar com a legibilidade do mesmo visando futuras manutenções. Requisitos e qualificaçõesDomina arquitetura de front-end e seus reflexos positivos e negativos nas demais áreas da empresaDomina a execução na criação e aplicação de rotinas de testes e boas práticas validatóriasDomina pré-processadores e metodologias CSS e boas práticasDomina o workflow proposto,consegue achar falhas e propor melhoriasDomina o ambiente do navegador (Render, Painting e etc)Consegue identificar falhas ou melhorias na estrutura backendSabe fundamentar decisões técnicas e transmitir para o time/clienteDiferenciais: Inglês (intermediário)Superior CompletoInformações adicionaisSeguro de vida MetlifeAssistência médica Unimed com coparticipaçãoAssistência odontológica AmilAssistência funeralCartão flash com crédito mensal para refeição/alimentação, ajuda home office + crédito flexAuxílio crecheDay off de aniversárioBolsa de estudo para idiomasJornada de trabalho flexívelParceria sescClube de vantagens com empresas e clientes parceirosPrograma de indicação com premiaçãoCultura de feedback e 1:1 constantesFerramenta de gestão de engajamento com escuta ativaPrograma de saúde e bem estar #feelgoodPrograma de diversidade e inclusão #coreyouPlataforma de cursos in company e parceria com a plataforma Gama Academy",
            "careerPageId": 105945,
            "careerPageName": "Corebiz",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/51022/career/105945/images/2022-10-18_17-47_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2023-11-09T13:44:20.097Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://corebiz.gupy.io/job/eyJqb2JJZCI6NTgxNjcwNSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://corebiz.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 5909653,
            "companyId": 702,
            "name": "Pessoa Desenvolvedora Front-end React",
            "description": "A ioasys é especialista em criar soluções únicas para empresas ousadas. Somos experts em trazer o melhor do universo digital para nossos clientes e transformar, repensar e evoluir a sociedade. Ajudamos marcas a inovar seguindo os princípios de metodologia ágil e abordagem centrada no usuário.Fazemos parte do Grupo Alpargatas, uma empresa centenária, global e inovadora. Caminhando juntos, desenvolvemos soluções de ponta a ponta, promovendo a transformação digital de grandes empresas do mercado nacional e internacional como: Banco Inter, Burger King, BASF, VR Benefícios, LATAM Airlines, Pfizer, Localiza, Fleury, DMCard, Fundação Dom Cabral e Suvinil. Proporcionamos um ambiente dedicado ao crescimento, com profissionais incríveis e de aprendizado constante em escritórios que estimulam a criatividade e produtividade. Você estará em uma equipe horizontal e transparente, que não apenas valoriza suas ideias, mas também espera que você faça parte da construção da empresa com a gente.Acreditamos no nosso trabalho e carregamos no nosso DNA a certeza de que temos o poder de impactar milhões de vidas com cada projeto que executamos. Não somos apenas pensadores, somos realizadores!Para a vaga de Pessoa Desenvolvedora Front-end React, buscamos um profissional que saiba trabalhar em equipe para agregar valor aos nossos projetos. Este profissional ficará responsável pelo desenvolvimento Front-end em React de grandes empresas do mercado nacional e internacional. Logo, espera-se que seja capaz de desenvolver interfaces propostas pela nossa equipe de design, fazendo animações, consumo de APIs e realizando testes (integração).Responsabilidades e atribuições• Manter e criar novas funcionalidades para clientes do mercado nacional e internacional em React;• Otimizar as interfaces para melhorar a performance e garantir a boa usabilidade;• Escrever códigos eficientes, reutilizáveis e de fácil manutenção;• Discutir possíveis soluções entre os times de UX , Back-end e Mobile;• Implementar automatização de testes.Requisitos e qualificações• Forte proficiência em JavaScript, incluindo manipulação de DOM;• Experiência com ferramentas comuns de desenvolvimento de front-end como Babel, Webpack, NPM, etc;• Versionamento de código (Git);• Metodologias ágeis (Scrum);• Compreensão de React.js e seus princípios fundamentais;• Nextjs;• Gerenciamento de estados (ContextAPI / Redux);• Conhecimento em White Label;• Conhecimento de UI e boas noções de UX.Diferenciais:• Capacidade de entender os requisitos de negócios e traduzi-los em requisitos técnicos;• Ter experiência em processos de code review;• Entendimento de Continuous Integration para React;Informações adicionaisRegime CLT ou PJ;Liberdade para exercer suas habilidades em um ambiente dinâmico e horizontal;Jornada flexível;Day Off – Birthday;Talks e Cursos internos ministrados por nossos especialistas;Curso de Inglês (In Company);Zenklub;Descontos de até 75% em produtos Alpa;Licença PET;Gympass;Moeda interna com loja de produtos próprios.Vem com a gente! Se inscreve aí! :)",
            "careerPageId": 882,
            "careerPageName": "ioasys",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/702/career/882/images/2023-05-08_14-51_companyLogoUrl.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2023-11-08T16:06:25.911Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://ioasys.gupy.io/job/eyJqb2JJZCI6NTkwOTY1Mywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://ioasys.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        }
    ],
    "pagination": {
        "offset": 0,
        "limit": 2,
        "total": 63
    }
}